[
    { "quote": "Adi was one of my favorite TAs of all time. He focused on the conceptual understanding of the topics, rather than forcing us to muddle through algebra. Personally, I lose sight of what I'm supposed to be learning if I get stuck on extremely tedious math errors and Adi helped me avoid that. Adi also created problems on the sets that were aligned with the material presented in class, but with slight twists. He had us applying the material to topics that were not what you'd typically expected to be thermodynamical, helping us recognize that the course applied further than we would normally have thought. His questions were a little confusing at first, but I had such clarity after figuring them out. Adi also kept it real and reminded us that we are all human and its okay to not be perfect all the time. I really, really enjoyed Adi as a TA and I wish I could take more courses with him. Thank you for being so helpful this quarter!"},
    { "quote": "Aditya is one of the most helpful, knowledgeable, and thoughtful teaching assistants I have ever had. The office hours were always so helpful and I looked forward to them each week. I really liked the approach to office hours and found the way Aditya explained and walked through the problems was very helpful. Even better would be when Aditya would give us the ball park for the answers to the homework even without giving//showing/or explaining the solution/method. This really took the pressure off when I was struggling on the homework since I would know right away if my answer was reasonable or completely wrong. When I wasn't able to attend office hours due to scheduling conflicts, Aditya was still very available, approachable, and made time to help."},
    { "quote": "Aditya was an incredible TA that performed on a level that all other TAs should aspire to. More than that, he is an incredibly caring and empathetic person, who was sensitive to the stressors of being a grad student or just being a person dealing with hard times. I am so grateful to have had him as my TA!"},
    { "quote": "Adi was excited about the course material and created very thought-provoking questions for the sets. He knew a lot about thermo, but was willing to admit when he couldn't help as much rather than lead us down some false path. Adi made sure we were understanding and learning in a way that didn't make the class overly stressful. He really was a fantastic TA and I would love to take any class he would TA (especially if its a topic he's similarly excited about)!"},
    { "quote": "Aditya explains from the ground up! He doesn’t assume you know the basics and goes to them if needed. He has a serene tone that facilitates understanding."},
    { "quote": "Aditya is an incredibly fair and thoughtful instructor, fostering a healthy culture of asking questions and giving space for all questions to receive consideration and a comprehensive response. I have really enjoyed learning from Aditya and he has certainly aided in my understanding of complex and nonintuitive thermodynamic concepts!"},
    { "quote": "Adi was super cognizant of different learning styles and ensures that everyone is following the material he covers in office hour. [He] was incredibly fair, making sure that people were never penalized in instances where material was presented in an unclear manner. Adi was also great at breaking down complicated subjects into tangible chunks, clearly explaining his reasoning and motivations with each conclusion he reached."},
    { "quote": "[Aditya's] questions being linked to real world contexts was very interesting and helped to contextualize why what we learned matters. [His] emphasis on understanding concepts conceptually felt much more interesting and engaging compared to grinding out calculations. [He] was very accommodating with deadlines and general class organization (OH times) which helped to offload some of the stress of the class."},
    { "quote": "Aditya taught me, and the rest of the class, a lot about how to apply concepts from class to problems. The problems he created were interesting and creative, often relating thermodynamic concepts to real-world scenarios."},
    { "quote": "I think what made Adi's teaching most effective was his approachability. I never felt like any question I had was \"dumb\" and his rapport with the students was fundamental to the healthy learning environment he cultured."},
    { "quote": "Aditya is a fantastic TA and really helped me understand how to approach a thermo problem and use my understanding of thermo to solve complex problems. I learned how to break down complex problems, apply approximations, and extract useful information from my results."},
    { "quote": "Adi was great at clarifying a lot of concepts for me, using very simple analogies, which I have no idea how he came up with."}
]